#include "ov5640_regs.h"

const uint8_t ov5640_default_regs[][3] = {


//Полярности и интерфейсы
			{0x47, 0x40, 0x20}, //  Устанавливает полярности PCLK (активный высокий), HREF (активный низкий) и VSYNC (активный высокий)
			//{0x47, 0x00, 0x00}, // Настраиваем DVP на параллельный 8-битный вывод

			{0x40, 0x50, 0x6e}, //Настройка PLL (ФАПЧ) сенсора
			{0x40, 0x51, 0x8f}, //Дополнительная настройка PLL
			{0x30, 0x08, 0x42}, // Программный сброс и выход из power down
			{0x31, 0x03, 0x03},  // Настройка предделителя системного PLL.  Bit[1]Выбор системных входных тактовых импульсов 0: от тактового генератора 1: от ФАПЧ
			{0x30, 0x17, 0xff}, // { 0x30, 0x17, 0x7f }, Регистр 0x3017 (PAD OUTPUT ENABLE 01)
		                            //Bit[6]: VSYNC (кадровая синхронизация) — 1: выход.
									//Bit[5]: HREF (строчная синхронизация) — 1: выход.
									//Bit[4]: PCLK (пиксельный тактовый сигнал) — 1: выход.
									//Bit[3:0]: D[9:6] (старшие 4 бита данных) — 1: выход.
			{0x30, 0x18, 0xff},  //Регистр 0x3018 (PAD OUTPUT ENABLE 02)
									//Bit[7:2]: D[5:0] (младшие 6 бит данных) — 1: выход.
									//Bit[1:0]: GPIO[1:0] — управление линиями общего назначения.
			{0x30, 0x2c, 0x02},  //Управление драйвовой способностью выходных пинов

//---------------------------------

//Настройки PLL и клоков
			{0x31, 0x08, 0x01},   // Настройка делителей PCLK [citation:5]
			{0x36, 0x30, 0x2e},  //36 Настройка VCM (Voice Coil Motor) драйвера для автофокуса
			{0x36, 0x32, 0xe2},  // Управление временем нарастания тока VCM
			{0x36, 0x33, 0x23},  //12 Управление временем спада тока VCM.
			{0x36, 0x21, 0xe0},  // Тайминги сброса и считывания строк
			{0x37, 0x04, 0xa0},  // Настройка таймингов
			{0x37, 0x03, 0x5a},  // Настройка таймингов
			{0x37, 0x15, 0x78},  // Настройка таймингов
		    {0x37, 0x17, 0x01},  // Настройка таймингов
		    {0x37, 0x0b, 0x60},  // Настройка таймингов
		    {0x37, 0x05, 0x1a},  //2c Настройка таймингов
			{0x39, 0x05, 0x02},  // Время остановки для аналоговых цепей
			{0x39, 0x06, 0x10},  // Время остановки для аналоговых цепей
			{0x39, 0x01, 0x0a},  // Дополнительный параметр аналоговых цепей
			{0x37, 0x31, 0x12},  // Внутренняя логика сенсора
			{0x36, 0x00, 0x08},  // Настройка таймингов
			{0x36, 0x01, 0x33},  // Настройка таймингов
			{0x30, 0x2d, 0x60},  // Настройка системных параметров
			{0x36, 0x20, 0x52},  // Настройка таймингов
			{0x37, 0x1b, 0x20},  // Настройка таймингов
			{0x47, 0x1c, 0x50},  // Настройка DVP таймингов

//---------------------------------


//Настройки PLL, HTS/VTS и AEC
			{0x30, 0x34, 0x18},    //18 Bit[6:4]: PLL charge pump control Bit[3:0]: MIPI bit mode 0xA: 10-bit mode Настройка PLL (10-битный режим).
			{0x30, 0x35, 0x41},    //21 Настройки PLL  SysDiv (p_div) — системный делитель (старшие биты 0x3035[7:4])
			{0x30, 0x36, 0x42},    //30 Настройки PLL  Множитель PLL (4~252) Может быть любым целым числом от 4 до 127 и только четным числом от 128 до 252
			{0x30, 0x37, 0x12},    //12 Настройки PLL  (предделитель) [citation:5]
			{0x30, 0x38, 0x00},    // ДОБАВИТЬ: Сброс тактового генератора
			{0x30, 0x39, 0x00},    // PLL Bypass выключен
			{0x38, 0x0c, 0x09},    // HTS  > X_ADDR_END
			{0x38, 0x0d, 0x60},    // HTS  > X_ADDR_END + 600 на затухание
			{0x38, 0x0e, 0x04},    // VTS  > Y_ADDR_END
			{0x38, 0x0f, 0x28},    // VTS  > Y_ADDR_END + 15 на затухание
			{0x3c, 0x01, 0xb4},    // Настройка детектора 50/60 Гц
			{0x3c, 0x00, 0x04},    // Настройка детектора 50/60 Гц
			{0x3a, 0x08, 0x00},    //1 Band step для 60 Гц (старший байт)
			{0x3a, 0x09, 0x93},	   //48 Band step для 60 Гц (младший байт)
			{0x3a, 0x0e, 0x06},    //3 Настройка AEC
			{0x3a, 0x0a, 0x00},    // Band step для 50 Гц (старший байт)
			{0x3a, 0x0b, 0x7b},    //c0 Band step для 50 Гц (младший байт)
			{0x3a, 0x0d, 0x08},    //4 Настройка AEC
			{0x3a, 0x00, 0x38},    // Управление AEC (night mode и banding)
			{0x3a, 0x02, 0x05},    //2 Night mode ceiling (60 Гц)
			{0x3a, 0x03, 0xc4},	   //e0 Night mode ceiling (60 Гц)
			{0x3a, 0x14, 0x05},    //4  Night mode ceiling (50 Гц).
			{0x3a, 0x15, 0xc4},    //60  Night mode ceiling (50 Гц).

//---------------------------------


//Настройки BLC и системные
			{0x36, 0x18, 0x00},  // Настройка таймингов
			{0x36, 0x12, 0x29},  // Настройка таймингов
			{0x37, 0x08, 0x64},  // Настройка таймингов
			{0x37, 0x09, 0x52},  //12 Настройка таймингов
			{0x37, 0x0c, 0x03},  // Настройка таймингов
			{0x40, 0x01, 0x02},  // BLC (Black Level Calibration) control
			{0x40, 0x04, 0x02},  // BLC line number
			{0x30, 0x00, 0x00},  // Настройка системы
			{0x30, 0x02, 0x1c},  // Настройка системы
			{0x30, 0x04, 0xff},  // Настройка системы (MCU on)
			{0x30, 0x06, 0xc3},  // Настройка системы
			{0x30, 0x0e, 0x58},  // Включает DVP, выключает (DVP mode, TX/RX power down, MIPI off)
			{0x30, 0x2e, 0x00},	 // Настройка системы


//---------------------------------

//Формат вывода и ISP
		    {0x43, 0x00, 0x00},  // Выбор формата RAW с обходом ISP.  [7:4] в 0xF (обход форматтера) [3:0] в 0x8 (выбор формата RAW)
			{0x50, 0x1f, 0x03},  // Настройка ISP в режим RAW (было 0x01 для RGB)
			{0x50, 0x00, 0x00},  // Отключаем функции ISP
			{0x50, 0x01, 0xa3},  // Включение SCL (Scaling) в ISP
			{0x46, 0x0b, 0x35},  // Настройка VFIFO
			{0x46, 0x0c, 0x22},  // Настройка VFIFO
			{0x38, 0x24, 0x02},  // Настройка PCLK divider
			{0x50, 0x3d, 0x00},  // Отключить тестовый паттерн

//---------------------------------


//Настройки AEC/AGC и детектора мерцания
			{0x3c, 0x07, 0x08}, // Порог измерения яркости (light meter threshold).
			{0x3c, 0x09, 0x1c}, // Второй порог измерения яркости.
			{0x3c, 0x0a, 0x9c}, // Количество выборок (старший байт)
			{0x3c, 0x0b, 0x40}, // Количество выборок (младший байт) = 40000
/*

{0x3a, 0x18, 0x00} — Верхний предел усиления (старший байт).
{0x3a, 0x19, 0xf8} — Верхний предел усиления (младший байт).
{0x36, 0x35, 0x1c} — Настройка AEC pre-gain.
{0x36, 0x34, 0x40} — Настройка AEC pre-gain (1x).
{0x36, 0x22, 0x01} — Настройка AEC.
{0x3c, 0x04, 0x28} — Настройка детектора 50/60 Гц.
{0x3c, 0x05, 0x98} — Настройка детектора 50/60 Гц.
{0x3c, 0x06, 0x00} — Настройка детектора 50/60 Гц.

{0x3c, 0x08, 0x00} — Настройка детектора 50/60 Гц.
 */
//---------------------------------


//Настройки зеркала, окна и выходного разрешения
			{0x38, 0x20, 0x47}, //40 Управление flip (вертикальное отражение)
			{0x38, 0x21, 0x01}, //0 Управление mirror (горизонтальное отражение) и бинингом Бит [0]   Значение 1 — включен, 0 — выключен.
			{0x38, 0x00, 0x00}, //X_ADDR_ST 0
			{0x38, 0x01, 0x00}, //X_ADDR_ST 0
			{0x38, 0x02, 0x00}, //Y_ADDR_ST 0
			{0x38, 0x03, 0x04}, //Y_ADDR_ST 0
			{0x38, 0x04, 0x0a}, // X_ADDR_END
			{0x38, 0x05, 0x3f}, // X_ADDR_END = ( X_ADDR_ST + X_OFFSET + X_OUTPUT_SIZE )  2623
			{0x38, 0x06, 0x07}, // Y_ADDR_END
			{0x38, 0x07, 0x9b}, // Y_ADDR_END = ( Y_ADDR_ST + Y_OFFSET + Y_OUTPUT_SIZE  ) 1764
			{0x38, 0x08, 0x00}, // X_OUTPUT_SIZE
			{0x38, 0x09, 0xa0}, // X_OUTPUT_SIZE 160
			{0x38, 0x0a, 0x00}, // Y_OUTPUT_SIZE
			{0x38, 0x0b, 0x78}, // Y_OUTPUT_SIZE 120
			{0x38, 0x10, 0x00}, //X_OFFSET  0
			{0x38, 0x11, 0x10}, //X_OFFSET  0
			{0x38, 0x12, 0x00}, //Y_OFFSET  0
			{0x38, 0x13, 0x06}, //Y_OFFSET  0
			{0x38, 0x14, 0x31}, //Шаг прореживания для пикселей.
			{0x38, 0x15, 0x31}, //Шаг прореживания для пикселей.

//---------------------------------


			{0x30, 0x08, 0x02},  // Системный сброс

			// Завершение
			//{0x00, 0x00, 0x00}
};



const uint32_t ov5640_default_regs_size = sizeof(ov5640_default_regs) / sizeof(ov5640_default_regs[0]);
